app/controllers/comments_controller.rb

SELECT * FROM "comments" WHERE ("comments".post_id = 1)
---
  def index
    if params[:since]
      @comments = Comment.find :all, :order => "created_at DESC", :conditions => [ "updated_at > ?",  params[:since] ]

SELECT * FROM "comments" WHERE ("comments"."id" = 1 AND ("comments".post_id = 1))
---
  def show
    comment = Comment.find params[:id]

INSERT INTO "comments" ("created_at", "body", "updated_at", "post_id", "commenter") VALUES('2010-05-29 03:26:29', 'hmmm. this whole thing is rather tricky', '2010-05-29 03:26:29', 1, 'ashleigh')
---
  def create
    @parent = parent_object
    @comment = @parent.comments.create(params[:comment])