app/controllers/flickr_controller.rb

  def update_location
    if @user.admin?
      photo = FlickrPhoto.find(params[:id])
      photo.lat = params[:latitude]
      photo.lon = params[:longitude]
      photo.save
---
SELECT * FROM "flickr_photos" WHERE ("flickr_photos"."id" = 250)
UPDATE "flickr_photos" SET "updated_at" = '2010-06-09 04:56:22', "lon" = -122.54930103302, "lat" = 46.4496738051926 WHERE "id" = 250