app/controllers/home_controller.rb

SELECT * FROM "flickr_photos" ORDER BY id DESC LIMIT 10
SELECT * FROM "posts"
---
  def index
    @photos = FlickrPhoto.find :all, :order => "id DESC", :limit => 5
    @posts = Post.find :all, :order => "created_at DESC"