app/controllers/map_controller.rb

  def index
    @posts = Post.published.order("created_at DESC")
    @photos = FlickrPhoto.all
---
SELECT * FROM "flickr_photos"