app/controllers/posts_controller.rb

  def index
    if params[:since]
      @posts = Post.find :all, :order => "created_at DESC", :conditions => [ "updated_at > ?",  params[:since] ]
---
SELECT * FROM "posts"

  def show
    @post = Post.find(params[:id])
---
SELECT * FROM "posts" WHERE ("posts"."id" = 1)

  def edit
    @post = Post.find(params[:id])
---
SELECT * FROM "posts" WHERE ("posts"."id" = 2)

  def create
    @post = Post.new(params[:post])
    @post.user = @user

    respond_to do |format|
      if @post.save
---
INSERT INTO "posts" ("name", "created_at", "title", "updated_at", "content") VALUES('Not Benson', '2010-05-29 23:35:15', 'A much longer post', '2010-05-29 23:35:15', 'n accumsan, elit at ullamcorper ultrices, leo orci porttitor magna, ut iaculis lorem diam quis libero. Vestibulum erat tellus, vehicula eget adipiscing non, semper sit amet augue. Sed ullamcorper, urna pulvinar adipiscing pharetra, quam metus eleifend arcu, sit amet luctus magna leo in dui. Aliquam eu adipiscing velit. Nulla viverra lacus ut tortor lobortis adipiscing. Sed ornare tempor lectus eu sagittis. Donec sed elit risus. Etiam fringilla, tellus vitae feugiat aliquet, urna neque volutpat enim, nec feugiat augue velit et nunc. Pellentesque ullamcorper pulvinar vehicula. Nulla sodales, orci et convallis tincidunt, nisl mi suscipit tortor, quis fringilla lacus felis eu urna. Suspendisse consectetur, neque in rutrum facilisis, dolor libero varius mauris, nec hendrerit metus lorem et diam. Vestibulum elementum nisi sit amet est pretium lobortis volutpat quam mattis. Nunc in nulla et arcu iaculis porttitor. Proin fringilla, erat sed molestie sodales, elit ante adipiscing dolor, non pretium tellus sapien vitae enim.

  def update
    @post = Post.find(params[:id])

    respond_to do |format|
      if @post.update_attributes(params[:post])
---
SELECT * FROM "posts" WHERE ("posts"."id" = 4)
UPDATE "posts" SET "updated_at" = '2010-05-29 23:41:01', "content" = 'n accumsan, elit at ullamcorper ultrices, leo orci porttitor magna, ut iaculis lorem diam quis libero. Nunc in nulla et arcu iaculis porttitor. Proin fringilla, erat sed molestie sodales, elit ante adipiscing dolor, non pretium tellus sapien vitae enim.

  def destroy
    @post = Post.find(params[:id])
    @post.destroy
---
SELECT * FROM "posts" WHERE ("posts"."id" = 3)
DELETE FROM "posts" WHERE "id" = 3